Tekla Open API Reference for Tekla Structures 2025
AssemblyFilterExpressions.PositionNumber Constructor
 Initializes a new instance of the PositionNumber class.
 Namespace: Tekla.Structures.Filtering.Categories
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public PositionNumber()
Public Sub New
See Also
Reference
AssemblyFilterExpressions.PositionNumber Class
Tekla.Structures.Filtering.Categories Namespace